-- 5.9.1
-- 問題: 1 --
-- 受験者id = 'SW1046' --
update 試験結果
set 午後1 = (80 * 4) - (86 + 68 + 91)
where 受験者id = 'SW1046'

-- 受験者id = 'SW1350' --
update 試験結果
set 論述 = (68 * 4) - (65 + 53 + 70)
where 受験者id = 'SW1350'

-- 受験者id = 'SW1877' --
update 試験結果
set 午前 = (56 * 4) - (59 + 56 + 36)
where 受験者id = 'SW1877'

-- 模範解答:1
-- 1 (A)
UPDATE 試験結果
   SET 午後1 = (80*4) - (86+68+91)
 WHERE 受験者ID = 'SW1046';

 -- 1 (B)
UPDATE 試験結果
   SET 論述 = (68*4) - (65+53+70)
 WHERE 受験者ID = 'SW1350';

 -- 1 (C)
UPDATE 試験結果
   SET 午前 = (56*4) - (59+56+36)
 WHERE 受験者ID = 'SW1877';

 ----------------------------------------
 
-- 問題: 2 --
select 受験者id
as 合格者ID
from 試験結果
where 午前 >= 60
and 120 <= (午後1 + 午後2)
and 論述 >= (午前 + 午後1 + 午後2) * 0.3

 -- 模範解答:2
 SELECT 受験者ID AS 合格者ID
  FROM 試験結果
 WHERE 午前 >= 60
   AND 午後1 + 午後2 >= 120
   AND 0.3 * (午前 + 午後1 + 午後2) <= 論述